In [1]:
import pandas as pd

In [5]:
data = {'Company':'Chivalry CentraMind DeepMind OpenAI'.split(),
        'Name': 'Soheil Babe Let Grab'.split(),
        'Age': [22,24,32,42]}

In [6]:
pd.DataFrame(data)

   Age     Company    Name
0   22    Chivalry  Soheil
1   24  CentraMind    Babe
2   32    DeepMind     Let
3   42      OpenAI    Grab

In [7]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [8]:
df = pd.DataFrame(data)

In [9]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [10]:
df.groupby('Company')

In [11]:
by_comp = df.groupby('Company')

In [12]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [16]:
by_comp.median()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [17]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [18]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [20]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [21]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [23]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [24]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [25]:
df['col2'].unique()

array([444, 555, 666])

In [26]:
df['col2'].nunique()

3

In [27]:
df['col2'].count()

4

In [29]:
pd.DataFrame(df['col2'].value_counts())

     col2
444     2
555     1
666     1

In [30]:
df['col3'].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

In [31]:
df['col3'].nunique()

4

In [32]:
df['col3'].value_counts()

xyz    1
def    1
abc    1
ghi    1
Name: col3, dtype: int64

In [33]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [36]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [41]:
def times2(x):
    return x ** 2

In [42]:
df['col2'].apply(times2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [44]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [45]:
df['col2'].sum()

2109

In [46]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [47]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [50]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi